# Brew
tap 'd12frosted/emacs-plus'
tap 'clojure/tools'
brew 'ansible'
brew 'awscli'
brew 'bat'
brew 'borkdude/brew/babashka'
brew 'borkdude/brew/clj-kondo'
brew 'borkdude/brew/jet'
brew 'borkdude/brew/neil'
brew 'cheat'
brew 'cloc'
brew 'clojure'
brew 'clojure-lsp-native', args: ["build-from-source"]
brew 'csvkit'
brew 'difftastic'
brew 'emacs-plus --with-modern-purple-flat-icon --with-native-comp'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'figlet'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'git-delta'
brew 'grep'
brew 'imagemagick'
brew 'ispell'
brew 'jq'
brew 'lame'
brew 'make'
brew 'mit-scheme'
brew 'nvim'
brew 'pgcli'
brew 'python'
brew 'rbenv'
brew 'rbenv-vars'
brew 'ripgrep'
brew 'rlwrap'
brew 'ruby-build'
brew 'sqlite'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'withgraphite/tap/graphite'
brew 'youtube-dl'
brew 'zoxide'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlightin'

# cask
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
cask '1password'
cask 'alfred'
cask 'arc'
cask 'caffeine'
cask 'daisydisk'
cask 'docker'
cask 'font-liberation-mono-for-powerline'
cask 'gpg-suite'
cask 'hammerspoon'
cask 'iterm2-nightly'
cask 'karabiner-elements'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'zprint'
