# Brew
tap 'd12frosted/emacs-plus'
tap 'clojure/tools'
brew 'ansible'
brew 'antigen'
brew 'awscli'
brew 'aws-vault'
brew 'borkdude/brew/babashka'
brew 'borkdude/brew/clj-kondo'
brew 'borkdude/brew/jet'
brew 'borkdude/brew/neil'
brew 'cheat'
brew 'cloc'
brew 'clojure'
brew 'clojure-lsp-native', args: ["build-from-source"]
brew 'csvkit'
brew 'emacs-plus --with-modern-purple-flat-icon --with-native-comp'
brew 'fd'
brew 'ffmpeg'
brew 'figlet'
brew 'fzf'
brew 'gcc'
brew 'git'
brew 'gh'
brew 'grep'
brew 'imagemagick'
brew 'ispell'
brew 'java11'
brew 'jq'
brew 'lame'
brew 'leiningen'
brew 'magic-wormhole'
brew 'make'
brew 'mit-scheme'
brew 'pgcli'
brew 'pick'
brew 'postgresql'
brew 'python'
brew 'rbenv'
brew 'rbenv-vars'
brew 'rename'
brew 'ripgrep'
brew 'rlwrap'
brew 'ruby-build'
brew 'sqlite'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tldr'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'youtube-dl'

# cask
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
cask '1password'
cask 'alfred'
cask 'caffeine'
cask 'cyberduck'
cask 'daisydisk'
cask 'figma'
cask 'google-chrome'
cask 'gpg-suite'
cask 'hammerspoon'
cask 'iterm2-nightly'
cask 'karabiner-elements'
cask 'slack'
cask 'spotify'
cask 'steam'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'adoptopenjdk/openjdk/adoptopenjdk8'
cask 'adoptopenjdk/openjdk/adoptopenjdk11'
cask 'adoptopenjdk/openjdk/adoptopenjdk16'
cask 'font-liberation-mono-for-powerline'
